In [10]:
import pandas as pd
import numpy as np 
df=pd.DataFrame(np.arange(0,16).reshape(4,4),index=['row1','row2','row3','row4'],columns=['column1','column2','column3','column4'])
print(df)

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15

In [5]:
df.to_csv('test1.csv')

In [13]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [14]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15

In [23]:
df.iloc[0:1,1:]

      column2  column3  column4
row1        1        2        3

In [29]:
df.iloc[:,1:].values.reshape(3,4)

array([[ 1,  2,  3,  5],
       [ 6,  7,  9, 10],
       [11, 13, 14, 15]])

In [32]:
df['column1'].unique()

array([ 0,  4,  8, 12])

In [34]:
type(df[['column1','column2']])

pandas.core.frame.DataFrame

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  4 non-null      int32
 1   column2  4 non-null      int32
 2   column3  4 non-null      int32
 3   column4  4 non-null      int32
dtypes: int32(4)
memory usage: 268.0+ bytes

In [37]:
df.describe()

         column1    column2    column3    column4
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [40]:
test=pd.read_csv('test1.csv',sep=',')

In [41]:
test.head

<bound method NDFrame.head of   Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15>

In [44]:
from io import StringIO ,BytesIO

In [46]:
data=('col1,col2,col3\n' 
      'x,y,1\n' 'a,b,2\n'
      'c,d,3')

In [54]:
df=pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [55]:
print(df)

  col1 col2
0    x    y
1    a    b
2    c    d

In [7]:
df.to_csv('test2.csv')

NameError: name 'pd' is not defined

In [2]:
df2.head()

NameError: name 'df2' is not defined

In [9]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15

In [29]:
data=('a,b,c\n'
      '4 ,apple,bat,\n'
      '8,orange,cow,')

In [30]:
print(data)
from io import StringIO,BytesIO

a,b,c
4 ,apple,bat,
8,orange,cow,

In [32]:

pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

#url
pd.read_csv('https://l ll' sep='\t');